Autodesk.Revit.DB.Visual.BumpMap.BumpmapType
The property labeled "Bump Type" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "BumpmapType".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureVRepeat
The property labeled "V Repeat" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureURepeat
The property labeled "U Repeat" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.BumpmapNormalScale
The property labeled "Amount" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.BumpmapDepth
The property labeled "Amount" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureScaleLock
The property labeled "Scale Lock" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleY
The property labeled "Size Y" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleX
The property labeled "Size X" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureWAngle
The property labeled "Angle" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 360".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureOffsetLock
The property labeled "Offset Lock" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetX
The property labeled "Offset X" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap.BumpmapBitmap
The property labeled "Source" from the "BumpMap" schema.
Remarks:
This property is of type "AssetPropertyString" and will contain a relative path.
Since:
2018.1

Autodesk.Revit.DB.Visual.BumpMap
Represents the properties of materials.
Since:
2018.1